
-- /*  麻将牌编码如下表
-- ============================================
-- 0x01 0x02 0x03 0x04 0x05 0x06 0x07 0x08 0x09
-- ============================================
-- 一万 二万 三万 四万 五万 六万 七万 八万 九万
-- ============================================
-- 0x11 0x12 0x13 0x14 0x15 0x16 0x17 0x18 0x19
-- ============================================
-- 一筒 二筒 三筒 四筒 五筒 六筒 七筒 八筒 九筒
-- ============================================
-- 0x21 0x22 0x23 0x24 0x25 0x26 0x27 0x28 0x29
-- ============================================
-- 一条 二条 三条 四条 五条 六条 七条 八条 九条
-- ============================================
-- 0x31 0x32 0x33 0x34 
-- ============================================
-- 东风 南风 西风 北风 
-- ============================================
-- 0x41 0x42 0x43
-- ============================================
-- 红中 发财 白板 
-- ============================================
-- 0x51 0x52 0x53 0x54 0x55 0x56 0x57 0x58
-- ============================================
-- 春   夏   秋   冬   梅   兰   菊   竹   
-- ============================================
-- */


--牌值被欧阳改了一遍。风门的可能对不上
--欧阳给的新牌值
	-- 0x31, 0x31, 0x31, 0x31,            //白
	-- 0x41, 0x41, 0x41, 0x41,            //中
	-- 0x51, 0x51, 0x51, 0x51,            //发

	-- 0x61, 0x61, 0x61, 0x61,            //东
	-- 0x71, 0x71, 0x71, 0x71,            //南
	-- 0x81, 0x81, 0x81, 0x81,            //西
	-- 0x91, 0x91, 0x91, 0x91,            //北

--获得花色
function getVariety(card)
	return bit.brshift(card, 4)
end

-- 获得牌值
function getValue(card)
    local value = bit.band(card, 0x0F)
    return value
end

function get_card_path( card_value )
	-- body
	local cardsImg="hall/majiangCard/"


	if card_value < 0 then
		card_value = card_value + 256
	end

	local v = getVariety(card_value)
	local value = getValue(card_value)

	local tb = {
	[0] = "wan",
	[1] = "tong",
	[2] = "tiao",
	[3] = "feng",
	[4] = "feng",
	[5] = "feng",
	[6] = "feng",
	[7] = "feng",
	[8] = "feng",
	[9] = "feng",
	}
	--print("card_value++++v++++++value++++++++=",card_value,"---",v,"...",value)
	local str_card_value = tostring(card_value)
	if str_card_value == "49" then
		str_card_value = 50
	end

	return cardsImg ..tb[v] .. "/"..str_card_value..".png"
end