--//四川中的胡牌类型
CARD_TYPE = 
{ 
    "天胡",--1
    "地胡",--2
    "清龙七对",--3
    "龙七对",--4
    "清七对",--5
    "清幺九",--6
    "清对" ,--7
    "将对",--8
    "清一色",--9
    "全幺九 ",--10
    "七对",--11
    "对对胡",--12
    "平胡",--13
    "将七对",--14
    "门清",--15
    "中张",--16
}     
     -- TIAN_HU_SC = 0x1,   //"天胡"
     -- DI_HU_SC=0x02,    //"地胡"
     -- QING_LONG_QI_DUI_SC=0x03,   //"清龙七对"
     -- LONG_QI_DUI_SC=0x04,        //"龙七对"
     -- QING_QI_DUI_SC=0x05,        //"清七对"
     -- QING_YAO_JIU_SC=0x06,       //"清幺九"
     -- QING_DUI_SC=0x07,           //"清对" 
     -- JIANG_DUI_SC=0x08,          //"将对"
     -- QING_YI_SE_SC=0x09,   //"清一色"
     -- DAI_YAO_JIU_SC=0x0A,        //"带幺九 "
     -- QI_DUI_SC=0x0B,    //"七对"
     -- DUI_DUI_HU_SC=0x0C,   //"对对胡"
     -- PING_HU_SC=0x0D,   //"平胡"

--用户操作类型
CAZUOTYPE={
    [1]="右吃",
    [2]="中吃",
    [4]="左吃",
    [8]="碰",
    [16]="碰杠",
    [32]="花杠",
    [64]="胡",
    [128]="抢杠胡",
    [256]="八花胡",
    [512]="暗杠",
    [1024]="补杠",
    [2048]="自摸",
    [4096]="听牌",
}

-- enum        //玩家操作类型
-- {
--  OPE_RIGHT_CHI = 0x001,   //右吃
--  OPE_MIDDLE_CHI = 0x002,   //中吃
--  OPE_LEFT_CHI = 0x004,   //左吃
--  OPE_PENG = 0x008,    //碰
--  OPE_GANG = 0x010,    //碰杠
--  OPE_HUA_GANG = 0x020,   //花杠
--  OPE_HU = 0x040,     //胡
--  OPE_GANG_HU = 0x080,   //抢杠胡
--  OPE_HUA_HU = 0x100,    //八花胡
--  OPE_AN_GANG = 0x200,   //暗杠
--  OPE_BU_GANG = 0x400,   //补杠
--  OPE_ZI_MO = 0x800,    //自摸
--  OPE_TING = 0x1000,    //听牌
-- };